MathematicalLogicAndTheoreticalCS/AConciseIntroductionToMathematicalLogic/AConciseIntroductionToMathematicalLogic.org
#+title: \zallman A Concise \\
#+title: \zallman Introduction\\
#+title: \zallman to\\
#+title: \zallman Mathematical \\
#+title: \zallman Logic\\
#+AUTHOR: Wolfgang Rautenberg
#+CREATOR:  Notes Taken by Dendy Li
#+LATEX_HEADER: \input{~/Preamble/preamble.tex}
#+LATEX_COMPILER: xelatex

\newpage

* COMMENT
**
Logic Symbols in Latex
+ and \wedge
+ or \vee
+ nagation \lnot
+ tautologically implies \models
** English Words Unfamiliar
+ conjunction: connect two words.
+ disjunction: separation between things.
+ incompatibility: two things don't fit well.
+ nihilation: reduce to nothing.
+ syntax: sets of rules and principles makes sentence satisfies the rule of the corresponding language
+ bind: tie sth together by using a physical or metaphorical connection
+ metaphorical: word or phrase applied to one object which doesn't literally describe but helps to convey a deeper understanding
+ convey: share an idea
+ aforemention: sth that is already talked about before


