MathematicalLogicAndTheoreticalCS/AConciseIntroductionToMathematicalLogic/AConciseIntroductionToMathematicalLogic.tex
% Created 2024-12-02 Mon 19:57
% Intended LaTeX compiler: xelatex
\documentclass[11pt]{article}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{capt-of}
\usepackage{hyperref}
\input{~/Preamble/preamble.tex}
\author{Wolfgang Rautenberg}
\date{\today}
\title{\zallman A Concise \\
\zallman Introduction\\
\zallman to\\
\zallman Mathematical \\
\zallman Logic\\
}
\hypersetup{
 pdfauthor={Wolfgang Rautenberg},
 pdftitle={\zallman A Concise \\
\zallman Introduction\\
\zallman to\\
\zallman Mathematical \\
\zallman Logic\\
},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Notes Taken by Dendy Li}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\newpage
