MathematicalLogicAndTheoreticalCS/AConciseIntroductionToMathematicalLogic/AConciseIntroductionToMathematicalLogic.org
* Propositional Logic
Overview:

*Boolean functions and boolean formula*
\begin{center}
\begin{tikzpicture}
\tikzstyle{line} = [draw, -latex']
\node[align = center] (model)
{\begin{tabular}{rc}
\textbf{Propositional valuation} & \\
\textbf{Realization} & \(\omega : \text{PV} \to \{0,1\}\) \\
\textbf{Propositional Model} &
\end{tabular}
};

\node[align = center, right = of model] (boolean)
{\textbf{Boolean Function:} \( f : \{0,1\}^n \to \{0,1\} \)};

\node[align = center, below = of model] (extend)
{By recursive definition of \textbf{Formulas}, extend \(\omega\) to:\\
\( \bar{\omega} : \varphi \to \{0,1\} \), \( \varphi \in F_n\).};

\node[below = of boolean] (space1)
{};

\node[align = center, below = 2cm of $(space1)!0.5!(extend)$] (recursive)
{\textbf{Fact: } \\
Assign a truth value to a formula \( \Leftrightarrow \) Assign a true value at all occurance of the PV};

\path [draw] (model) -- (extend);
\path [draw] (extend) -- (recursive);
\path [draw] (recursive) edge["\(\bar{\omega}\varphi = f(\omega \vec{p})\)"'] (boolean);

\end{tikzpicture}
\end{center}

*Semantic of Propositional Logic*
\begin{center}
\begin{tikzpicture}
\tikzstyle{line} = [draw, -latex']

\node[align = center] (equiv)
{\textbf{Semantic Equivalence:} \\
\(\alpha \equiv \beta \Leftrightarrow \omega\alpha \equiv \omega\beta\)};

\node[align = center, below = 2cm of equiv] (replace)
{\textbf{Replacement Theorem:} \\
\(\alpha \equiv \alpha' \Rightarrow \varphi \equiv \varphi'\), \\
\( \varphi' \) is obtained from \( \varphi \) by replacing occurence of  \( \alpha \) in \( \varphi \), by \( \alpha' \).};

\node[align = center, right = of $(equiv)!0.5!(replace)$] (Rep)
{\textbf{Motivation:} \\
If every boolean functions can \\
be represented by a boolean formula?};

\node[align = center, below = 2cm of $(Rep)!0.5!(replace)$] (DNF)
{Every boolean function \( f \) can be represented by DNF \( \alpha_f \), i.e. \\
\( \alpha_f := \lor_{f\vec{x} = 1} p_1^{x_1} \land \cdots \land p_n^{x_n}\), \\
where \( (x_1, \dots, x_n) \in \{0,1\}^n \), \( p_i^0 := p_i, p_i^1 := \neg p_i \).};

\node[align = center, below = of DNF] (funcomp)
{\textbf{Functional Complete:} \\
Logical signature is functional complete it can represent every boolean functions.};

\path [draw] (equiv) -- (replace);
\path [draw] (replace) -- (DNF);
\path [draw] (DNF) -- (funcomp);

\end{tikzpicture}
\end{center}

\newpage
*Logical Consequence and its properties*

\begin{center}
\begin{tikzpicture}
\tikzstyle{line} = [draw, -latex']

\node[align = center] (model)
{\textbf{Model:} \\
If \( \omega\alpha = 1 \), \( \omega \) is a model of \( \alpha \), \\
or \( \omega \) satisfies \( \alpha \), denote as \( \omega \models \alpha \). \\
This definition can naturally be extended to \\
a set of formulas \( X \). \\
\( \models \) is the satisfiability relation. \\
\( \alpha (X) \) is satisfiable if there exists a model.};

\node[align = center, below = of model] (logc)
{\textbf{Logical Consequence:} \\
If \( \omega \models X \), then \( \omega \models \alpha \). \\
We say \( \alpha \) is a logical consequence of \( X \).};

\node[align = center, right = of model] (tautocontra)
{\textbf{Tautology:} \\
If all \( \omega \) satisfy \( \alpha \), \\
\( \alpha \) is a tautology. \\
\textbf{Contradiction:} \\
If all \( \omega \) don't satisfy \( \alpha \), \\
\( \alpha \) is a contradiction. \\
\textbf{Negation of a tautology isn't a contradiction.}};

\node[align = center, below = of logc] (proplogc)
{\textbf{Basic properties of \( \models \):} \\
\begin{tabular}{l}
(R) : \textbf{Reflexive} \\
(M) : \textbf{Monotone} \\
(T) : \textbf{Transitive} \\
\end{tabular}};

\node[align = center, right = of proplogc] (factontau)
{\textbf{Fact of Tautology:} \\
Tautologies of the form \( \alpha \lor \neg\alpha \) is implied by \( p \lor \neg p \).};

\node[align = center, below = of factontau] (substitution)
{(S) : \textbf{Invariance Substitution}};

\node[align = center, below = of proplogc] (compact)
{(F) : \textbf{Finitary:} \\
\( X \models \alpha \Rightarrow X_0 \models \alpha \), \\
\( X_0 \subseteq X \), \( X_0 \) finite.};

\node[align = center, below = 2cm of $(compact)!0.5!(substitution)$] (general)
{\( \models \) shares the properties (RMTS) with almost all classical / non classical Logical systems. \\
A propositional consequence relation \( \vdash \), is a relation \\
between sets of formulas and formulas of a given FOL \( \calf \), \\
with properties corresponds to (RMTS).};

\node[align = center, below = of general] (deduction)
{\textbf{Deduction Theorem:} \\
\( X, \alpha \models \beta \Rightarrow X \models \alpha \to \beta\).};

\path [draw] (model) -- (logc);
\path [draw] (logc) -- (proplogc);
\path [draw] (deduction) -- (general);
\path [draw] (proplogc) -- (factontau);
\path [draw] (factontau) -- (substitution);
\path [draw] (substitution) -- (general);
\path [draw] (factontau) -- (tautocontra);
\path [draw] (model) -- (tautocontra);

\end{tikzpicture}
\end{center}

*Syntax of Complete Calculus for \( \models \):*

\begin{center}
\begin{tikzpicture}
\tikzstyle{line} = [draw, -latex']

\node[align = center] (prove)
{\textbf{Derivability Relation \( \vdash \):} \\
\( \vdash \) is a relation between set of formulas and formulas. \\ If \( \vdash \) can applies to pair \( (X, \alpha) \), denote as \( X \vdash \alpha \), \\ call \( \alpha \) is a derivation from \( X \). Otherwise \( X \not\vdash \alpha \). \\ \( (X, \alpha) \) is called \textbf{sequent} w.r.t. Gentzen. \\
\textbf{Calculus on \( \vdash \):} \\
\begin{tabular}{l}
(1) : A functional complete logical signature \(\{\land, \neg\}\); \\
(2) : 6 basic rules which are designed for completeness, \\ these 6 rules will be showed in the equivalent definition below; \\
(3) : Provable rules / Derivable rules are the rules \\ can be intefere from (1) (2).\end{tabular} \\
\textbf{Remark:} \( \frac{X, \neg\alpha \vdash \beta, \neg\beta}{X \vdash \neg\alpha}\).};

\node[align = center, below = of prove] (formalprove)
{\textbf{Derivability Relation \( \vdash \) (Equivalent Definition):} \\
Smallest relation \( \subseteq \mathfrak{B}\calf \times \calf \) and \\ closed under the following 6 rules: \\
\begin{tabular}{ll}
\( \frac{ }{\alpha \vdash \alpha} \) & \( \frac{X \vdash \alpha}{X' \vdash \alpha}, X \subseteq X' \). \\
\( \frac{X \vdash \alpha, \beta}{X \vdash \alpha \land \beta} \) & \( \frac{X \vdash \alpha \land \beta}{X \vdash \alpha, \beta} \) \\
\( \frac{X \vdash \neg \alpha, \alpha}{X \vdash \beta} \) & \( \frac{\alpha, X \vdash \beta | X, \neg \alpha \vdash \beta}{X \vdash \beta} \)
\end{tabular}};

\node[align = center, right = of prove] (models)
{\textbf{Consequence Relation \( \models \)}};

\node[align = center, below = of formalprove] (conventionofprove)
{\textbf{Conventions of \( \vdash \):} \\
\begin{tabular}{l}
\( X, \alpha \vdash \alpha \Leftrightarrow X \cup \alpha \vdash \alpha \); \\
\( X \vdash \alpha, \beta \Leftrightarrow X \vdash \alpha \text{and} X \vdash \beta \); \\
The syntax is of the form \( \frac{\text{Premises}}{\text{Inference}}\).
\end{tabular}};

\node[align = center, below = of models] (syntacticmeaning)
{\textbf{Syntactical Meaning of \( X \vdash \alpha \):} \\
\( (X, \alpha) \) can be obtain \\ from stepwise application.};

\node[align = center, below = of syntacticmeaning] (derivation)
{\textbf{Derivation:} \\
Derivation is the records of the \\ stepwise application process. \\
\textbf{Derivation(Formal):} \\
A derivation of \( (X, \alpha) \) \\ is a tuple \( (S_0, \dots, S_{n-1}, S_n) \) \\ where \( S_n = (X, \alpha) \), each of \( S_i \) \\ is obtained by the following rules: \\
\begin{tabular}{l}
(1) IS ; \\
(2) Basic rules applies on \( S_k, k \leq i \).
\end{tabular}};

\path [draw] (syntacticmeaning) -- (models);
\path [draw] (derivation) -- (syntacticmeaning);
\path [draw] (prove) -- (formalprove);
\path [draw] (formalprove) -- (conventionofprove);
\path [draw] (prove) edge["\tiny{identical with}"] (models);

\end{tikzpicture}
\end{center}

*Semantics of \( \vdash \):*

\begin{center}
\begin{tikzpicture}
\tikzstyle{line} = [draw, -latex']

\node[align = center] (induction-on-property) at (0,0)
{\textbf{Property of sequents:} \\
\( \cale \) is a property of sequents, \\ i.e. \( \cale \) can apply on the pair \( (X, \alpha) \). \\
\textbf{Induction on property:} \\
Let \( \cale \) be a property closed under \( \vdash \), \\ then \( X \vdash \alpha \) implies \( \cale(X,\alpha) \). \\ \( \cale := \models \) is a good example.};

\node[align = center, right = of induction-on-property] (semantic-soundness)
{\textbf{Soundness(Semantic):} \\
\( \vdash \subseteq \models \)};

\node[align = center, below = 2cm of $(induction-on-property)!0.5!(semantic-soundness)$] (connect)
{With induction on property, we will deduce \\ a symmetric process \\ which builds a relation of \( \vdash \) and \( \models \).};

\node[align = center, below = of connect] (finiteness-theorem-prove)
{\textbf{Finiteness theorem for \( \vdash \):} \\
If \( X \vdash \alpha \), then exists finite \( X_0 \subseteq X \) with \( X_0 \vdash \alpha \).};

\node[align = center, below left = of finiteness-theorem-prove, text width = 0.3 \textwidth] (consistent)
{\textbf{Consistent:} \\
\( X \subseteq \calf \) is consistent if \( X \vdash \alpha \) for all \( \alpha \); else consistent. \\
\( X \subseteq \calf \) is maximal consistent if \( X \) is consistent and any \( X \subseteq Y \), is inconsistent.};

\node[align = center, below = of consistent] (top-down-bottom-up)
{\( C^+ : X \vdash \alpha \Leftrightarrow X, \neg\alpha \vdash \bot \); \\
\( C^- : X \vdash \neg\alpha \Leftrightarrow X, \alpha \vdash \bot \).};

\node[align = center, right = of consistent] (Lindenbaum)
{\textbf{Lindenbaum's theorem:} \\
Every consistent set \( X \) can be extended \\ to a maximally consistent set \( X' \supseteq X \)};

\node[align = center, below right = of consistent] (property-max-consistent)
{\textbf{Properties of maximal consistent:} \\
\begin{tabular}{l}
(1) : \( X \vdash \neg\alpha \Leftrightarrow X \not\vdash \alpha \); \\
(2) : Maximally consistent set \( X \) is satisfiable.
\end{tabular}};

\node[align = center, below = of property-max-consistent] (completeness)
{\textbf{Completeness theorem:} \\
\( X \vdash \alpha \Leftrightarrow X \models \alpha \).};

\node[align = center, below = of completeness] (result-completeness)
{\textbf{Results of completeness theorem:} \\
\begin{tabular}{l}
(1) : If \( X \vdash \alpha \), then fintite \( X_0 \subseteq X \), \( X_0 \models \alpha \). \\
(2) : A set \( X \) is satisfiable then each finite subset of \( X \) is satisfiable.\end{tabular}};

\path [draw] (property-max-consistent) -- (completeness);
\path [draw] (completeness) -- (result-completeness);
\path [draw] (property-max-consistent) -- (consistent);
\path [draw] (induction-on-property) edge["induce"] (semantic-soundness);
\path [draw] (finiteness-theorem-prove) -- (connect);
\path [draw] (consistent) -- (finiteness-theorem-prove);
\path [draw] (consistent) -- (top-down-bottom-up);

\end{tikzpicture}
\end{center}

*Hilbert Calculi:*

\begin{center}
\begin{tikzpicture}
\tikzstyle{line} = [draw, -latex']

\node[align = center] (Hilbert)
{\textbf{Hilbert Calculi \( \vdash_H \):} \\
\begin{tabular}{l}
(1) Logical Signature : \( \{\neg, \land\} \) \\
(2) Logical axiom scheme : \\
1. \( (\alpha \to \beta \to \gamma) \to (\alpha \to \beta) \to \alpha \to \gamma \); \\
2. \( \alpha \to \beta \to \alpha \land \beta \); \\
3. \( \alpha \land \beta \to \alpha \), \( \alpha \land \beta \to \beta \); \\
4. \( (\alpha \to \neg \beta) \to \beta \to \neg \alpha \).
\end{tabular}};

\end{tikzpicture}
\end{center}

