MathematicalLogicAndTheoreticalCS/AConciseIntroductionToMathematicalLogic/AConciseIntroductionToMathematicalLogic.org
** Boolean Functions and Formulas
*** What is Prositional Language?
#+ATTR_LATEX: :options [n-ary Boolean Functions]
#+begin_definition
\(f:\{0,1\}^n\to\{0,1\}\) is called an \(n\)-ary Boolean function or Truth function.
#+end_definition

#+begin_proposition
\(n\)-ary Boolean function \(f\) has \(2^n\) tuples in its *domain*, this gives \(2^{2^n}\) ways to construct an \(n\)-ary Boolean function.
#+end_proposition

#+begin_definition
We denote the totality above as \(\mathbf{B}_n\), that is \(\mathbf{B}_n=2^{2^n}\).
#+end_definition

#+ATTR_LATEX: :options [Propositional Language(defined by induction)]
#+BEGIN_definition
Given a set of logic symbols(/Logical signature/) and a set of variables. We define propositional language \(\mathfrak{F}\) inductively:
1. one-element strings are formulas(/Prime Formulas/).
2. If \(\alpha, \beta\) are all formulas then \(\alpha \circ \beta\) here \(\circ\) refers to binary Boolean Functions and \(\lnot\alpha\in S.\)
#+END_definition


Based on set theory we also have another definition:
#+ATTR_LATEX: :options [Propositional Language(defined in set-theoretical way)]
#+BEGIN_definition
Propositional Language \(\mathfrak{F}\) is the smallest set of all *String* \(S\) built from /logic symbols/ and /propsitional variables/, satisfying the following properties:
\begin{itemize}
\item[f1] \(p_1,\dots\in S.\)
\item[f2] \(\alpha,\beta\in S\) they are closed under the binary Boolean function and unary Boolean function.
\end{itemize}
#+END_definition

#+ATTR_LATEX: :options [Formula]
#+BEGIN_definition
A string in a propositional language is a formula.
#+END_definition

#+ATTR_LATEX: :options [ ]
#+BEGIN_examplle
For Boolean Signature we have the Boolean formulas.
#+END_examplle

Worth noticing that we don't use parentheses for the unary operation.

*Now we let \(\mathfrak{F}\) to be the set of all Boolean formulas.*

For convention we obey the following rules:
1. Omit the outside parentheses.
2. If order of the logic connectives makes the formula no ambiguity without parentheses then we omit the parentheses.
3. Multiple use of \(\rightarrow\) we associate to the right; multiple use of other binary connectives we associate them to the left.

*In arithmetic one used to associate to the left but \(x^{y^z}\) is an example of associate to the right.*

#+ATTR_LATEX: :options [Induction principle for formulas]
#+BEGIN_theorem
Let \(\Epsilon\) be a property of strings(We write \(\Epsilon\psi\) to represent \(\Epsilon\) is a property of string \(\psi\)), such that(If one can show):
- \(\Epsilon\pi\) for prime formual \(\pi\),
- \(\Epsilon\alpha, \Epsilon\beta\), then the formulas building from \(\alpha, \beta\) also have this property.
Then \(\Epsilon\) holds for all formula.
#+END_theorem

*Some Language notation:*
- *Such that means suppose to show, means the goal is...*

- *Compound is the words from chemestry, which means that many different kinds of elements together form sth, this sth is so-called compound.*

#+ATTR_LATEX: :options [Unique reconstruction property]
#+BEGIN_theorem
If \(\alpha, \beta\) where \(\alpha \circ \beta\) construct \(\varphi\), then \(\alpha, \beta\) are uniquely determined.
#+END_theorem

This property looks very weird since it somehow have the idea of the free generation and have some idea of unique readability theorem.

#+ATTR_LATEX: :options [Inductive defintion of subformula]
#+BEGIN_definition
- subformula of prime formula is itself
- subformula of \(\neg \alpha\) is \(\{\neg \alpha\} \cup \) subformula of \(\alpha\)
- for boolean signature just the natural way: itself and subformulas of the component.
#+END_definition

*By arithmetic one emphersize the numbers and the operations on it.*

#+ATTR_LATEX: :options [Propositional valuation(Realization of propositional model)]
#+BEGIN_definition
A propositional valuation \(\omega\) is a function \(\omega:PV \to \{0,1\}\).
#+END_definition

*Stipulation: a rule must be follow or sth must be done.*

we can extend the valuation in natural inductive way:
- \(\omega\alpha \circ \beta = \omega\alpha \circ \omega\beta\)
- \(\omega\neg\alpha = \neg\omega\alpha\)

By the extension we can talk about the valuation of formula \(\varphi\).

For the next part we will talk about the connection between boolean functions and boolean formulas

*** Correspondence between boolean formulas and boolean functions
** Semantic Equivalence and Normal Forms
* Predicate Logic
** Overview of the basical objects

\begin{center}
\begin{tikzpicture}
\tikzstyle{line} = [draw, -latex']

\node[align = center] (symbols)
{\begin{tabular}{l}
\textbf{Extralogical Structure \( L \):} \\
Constant symbols, function symbols, relation symbols. \\
e.g. in group theory \(\{ \circ, e\}\). \\

\textbf{\( L \)- Structure \(\cala\):} \\
\( (A, L^{\cala}) \), \( A \) is the domain of \( \cala \), \\
\( L^{\cala} \) consists of the interpretation of the extralogical structure. \\
\end{tabular}};

\node[align = center, below = of symbols] (alphabet)
{\begin{tabular}{l}
\textbf{Alphabet of \( L \):} \\
The alphabet of \( L \) consists of \( L \), \\
logical symbols and varibales.

\textbf{Strings of \( L \):} \\
\( \cals := \{ \text{The set of all strings from } L \} \).
\end{tabular}
};

\node[below = of alphabet] (spaceA)
{};

\node[align = center, right = of spaceA] (recursive)
{\begin{tabular}{l}
\textbf{Recursive definition of:} \\
Terms \\
Prime Formulas \\
Varibales
\end{tabular}};

\node[align = center, below = of spaceA] (FOL)
{\begin{tabular}{l}
\textbf{\( \call \) := \{The set of all formulas determined by \( L \).\}}\\
\textbf{\( \call^0 \) := \{The set of all the sentences\}.} \\
\textbf{Sentences: } Formula with no free variable.
\end{tabular}};

\node[align = center, below = of FOL] (Lstructure)
{\( L \)- structure for extralogical symbol \( L \), \\
naturally become \( \call \)- structure, \\
with the recursive definition of terms and formulas.};

\path [line] (symbols) -- (alphabet);
\path [line] (alphabet) -- (FOL);
\path [line] (FOL) -- (Lstructure);



\end{tikzpicture}
\end{center}

