MathematicalLogicAndTheoreticalCS/AConciseIntroductionToMathematicalLogic/AConciseIntroductionToMathematicalLogic.tex
\subsection{Boolean Functions and Formulas}
\label{sec:org5897f19}
\subsubsection{What is Prositional Language?}
\label{sec:orgd5acf80}
\begin{definition}[n-ary Boolean Functions]
\(f:\{0,1\}^n\to\{0,1\}\) is called an \(n\)-ary Boolean function or Truth function.
\end{definition}

\begin{proposition}
\(n\)-ary Boolean function \(f\) has \(2^n\) tuples in its \textbf{domain}, this gives \(2^{2^n}\) ways to construct an \(n\)-ary Boolean function.
\end{proposition}

\begin{definition}
We denote the totality above as \(\mathbf{B}_n\), that is \(\mathbf{B}_n=2^{2^n}\).
\end{definition}

\begin{definition}[Propositional Language(defined by induction)]
Given a set of logic symbols(\emph{Logical signature}) and a set of variables. We define propositional language \(\mathfrak{F}\) inductively:
\begin{enumerate}
\item one-element strings are formulas(\emph{Prime Formulas}).
\item If \(\alpha, \beta\) are all formulas then \(\alpha \circ \beta\) here \(\circ\) refers to binary Boolean Functions and \(\lnot\alpha\in S.\)
\end{enumerate}
\end{definition}


Based on set theory we also have another definition:
\begin{definition}[Propositional Language(defined in set-theoretical way)]
Propositional Language \(\mathfrak{F}\) is the smallest set of all \textbf{String} \(S\) built from \emph{logic symbols} and \emph{propsitional variables}, satisfying the following properties:
\begin{itemize}
\item[f1] \(p_1,\dots\in S.\)
\item[f2] \(\alpha,\beta\in S\) they are closed under the binary Boolean function and unary Boolean function.
\end{itemize}
\end{definition}

\begin{definition}[Formula]
A string in a propositional language is a formula.
\end{definition}

\begin{examplle}[ ]
For Boolean Signature we have the Boolean formulas.
\end{examplle}

Worth noticing that we don't use parentheses for the unary operation.

\textbf{Now we let \(\mathfrak{F}\) to be the set of all Boolean formulas.}

For convention we obey the following rules:
\begin{enumerate}
\item Omit the outside parentheses.
\item If order of the logic connectives makes the formula no ambiguity without parentheses then we omit the parentheses.
\item Multiple use of \(\rightarrow\) we associate to the right; multiple use of other binary connectives we associate them to the left.
\end{enumerate}

\textbf{In arithmetic one used to associate to the left but \(x^{y^z}\) is an example of associate to the right.}

\begin{theorem}[Induction principle for formulas]
Let \(\Epsilon\) be a property of strings(We write \(\Epsilon\psi\) to represent \(\Epsilon\) is a property of string \(\psi\)), such that(If one can show):
\begin{itemize}
\item \(\Epsilon\pi\) for prime formual \(\pi\),
\item \(\Epsilon\alpha, \Epsilon\beta\), then the formulas building from \(\alpha, \beta\) also have this property.
\end{itemize}
Then \(\Epsilon\) holds for all formula.
\end{theorem}

\textbf{Some Language notation:}
\begin{itemize}
\item \textbf{Such that means suppose to show, means the goal is\ldots{}}

\item \textbf{Compound is the words from chemestry, which means that many different kinds of elements together form sth, this sth is so-called compound.}
\end{itemize}

\begin{theorem}[Unique reconstruction property]
If \(\alpha, \beta\) where \(\alpha \circ \beta\) construct \(\varphi\), then \(\alpha, \beta\) are uniquely determined.
\end{theorem}

This property looks very weird since it somehow have the idea of the free generation and have some idea of unique readability theorem.

\begin{definition}[Inductive defintion of subformula]
\begin{itemize}
\item subformula of prime formula is itself
\item subformula of \(\neg \alpha\) is \(\{\neg \alpha\} \cup\) subformula of \(\alpha\)
\item for boolean signature just the natural way: itself and subformulas of the component.
\end{itemize}
\end{definition}

\textbf{By arithmetic one emphersize the numbers and the operations on it.}

\begin{definition}[Propositional valuation(Realization of propositional model)]
A propositional valuation \(\omega\) is a function \(\omega:PV \to \{0,1\}\).
\end{definition}

\textbf{Stipulation: a rule must be follow or sth must be done.}

we can extend the valuation in natural inductive way:
\begin{itemize}
\item \(\omega\alpha \circ \beta = \omega\alpha \circ \omega\beta\)
\item \(\omega\neg\alpha = \neg\omega\alpha\)
\end{itemize}

By the extension we can talk about the valuation of formula \(\varphi\).

For the next part we will talk about the connection between boolean functions and boolean formulas
\subsubsection{Correspondence between boolean formulas and boolean functions}
\label{sec:org8c01bcf}
\subsection{Semantic Equivalence and Normal Forms}
\label{sec:orgca3f5ef}
\section{Predicate Logic}
\label{sec:orgae57b74}
\subsection{Overview of the basical objects}
\label{sec:orgfc0c572}

\begin{center}
\begin{tikzpicture}
\tikzstyle{line} = [draw, -latex']

\node[align = center] (symbols)
{\begin{tabular}{l}
\textbf{Extralogical Structure \( L \):} \\
Constant symbols, function symbols, relation symbols. \\
e.g. in group theory \(\{ \circ, e\}\). \\

\textbf{\( L \)- Structure \(\cala\):} \\
\( (A, L^{\cala}) \), \( A \) is the domain of \( \cala \), \\
\( L^{\cala} \) consists of the interpretation of the extralogical structure. \\
\end{tabular}};

\node[align = center, below = of symbols] (alphabet)
{\begin{tabular}{l}
\textbf{Alphabet of \( L \):} \\
The alphabet of \( L \) consists of \( L \), \\
logical symbols and varibales.

\textbf{Strings of \( L \):} \\
\( \cals := \{ \text{The set of all strings from } L \} \).
\end{tabular}
};

\node[below = of alphabet] (spaceA)
{};

\node[align = center, right = of spaceA] (recursive)
{\begin{tabular}{l}
\textbf{Recursive definition of:} \\
Terms \\
Prime Formulas \\
Varibales
\end{tabular}};

\node[align = center, below = of spaceA] (FOL)
{\begin{tabular}{l}
\textbf{\( \call \) := \{The set of all formulas determined by \( L \).\}}\\
\textbf{\( \call^0 \) := \{The set of all the sentences\}.} \\
\textbf{Sentences: } Formula with no free variable.
\end{tabular}};

\node[align = center, below = of FOL] (Lstructure)
{\( L \)- structure for extralogical symbol \( L \), \\
naturally become \( \call \)- structure, \\
with the recursive definition of terms and formulas.};

\path [line] (symbols) -- (alphabet);
\path [line] (alphabet) -- (FOL);
\path [line] (FOL) -- (Lstructure);



\end{tikzpicture}
\end{center}
