MathematicalLogicAndTheoreticalCS/AConciseIntroductionToMathematicalLogic/AConciseIntroductionToMathematicalLogic.org
** Mathematical Structures

#+ATTR_LATEX: :options ["Specific" Structure and related definition]
#+BEGIN_definition
For structure \(\mathfrak{A}\) we have the following description:

\begin{center}
\begin{tabular}{ccc}
Notations & \(A\): Domain & relations \(r\), operations \(f\), constant \(c\)\\

Descriptions & finite(infinite) structure & relation(algebraic) structure
\end{tabular}
\end{center}

+ Relation structure has no operation and constant
+ Algebraic structure has no relation
#+END_definition

*We want to study the class of structures, so we need a "connection" which enables us to talk about a class of structures.*

#+ATTR_LATEX: :options [Extralogical Signature]
#+BEGIN_definition
A finite set \(L\) consisting of relation, operation, and constant symbols of given arity, is a (extralogical) structure.
#+END_definition

#+ATTR_LATEX: :options [Closed under operations]
#+BEGIN_definition
\(\forall a \in A^n \Rightarrow fa \in A\).
#+END_definition

#+ATTR_LATEX: :options [Restriction to a subset of domain]
#+BEGIN_definition
*Restriction for Relation:*
+ Intersect product sets
*Restriction for Operations:*
+ Closed under operations w.r.t. the subset which we want to restrict on.
#+END_definition

#+ATTR_LATEX: :options [Substructure]
#+BEGIN_definition
Let \(\mathfrak{B}\) be an L-Structure, \(A \subset B\) nonempty and closed
under all operations of \(B\) and inherits all the interpratations of constant of \(B\).
#+END_definition

#+ATTR_LATEX: :options [Common properties of binary operations and binary relations]
#+BEGIN_proposition
*Properties for binary operations:*
+ Commutivity;
+ Associativity;
+ Idempotent: \(a \circ a = a\);
+ Invertible: \(\forall a,b, \exists x,y \Rightarrow a \circ x = b \land y \circ a = b\).

*Properties for binary relations:*
+ reflexive and irreflexive;
+ symmetric and antisymmetric;
+ transitive;
+ connex(Trinity).
#+END_proposition



** Syntax of Elementary Languages

\begin{center}
\begin{tikzpicture}
\tikzstyle{line} = [draw, -latex']

\node [align = center] (Term)
{\textbf{Term} \\
\begin{tabular}{l}
1. \textbf{Prime Term} : Variables and constants \\
2. \textbf{Compound of functional symbol and terms}
\end{tabular}};

\node[right = of Term, align = center] (Formula)
{\textbf{Formula} \\
\begin{tabular}{l}
1. \textbf{Terms} \\
2. \textbf{Compound of relation and terms} \\
3. \textbf{Compound of logical connectives} \\ \textbf{and formulas}
\end{tabular}};

\node[below = of Formula] (Variables)
{\begin{tabular}{l}
1. \textbf{Variable} \\
2. \textbf{Free Variable} \Rightarrow \textbf{Sentences}\\
3. \textbf{Bounded Variable}
\end{tabular}
};


\path [line] (Term) -- (Formula);
\path [line] (Formula) -- (Variables);

\end{tikzpicture}
\end{center}

*Goal: We want to delimit(determine the limit) the theoretical framework which enables us to precisely talk about mathematical structures*

This goal arise the definition of object language.
#+ATTR_LATEX: :options [Object Language]
#+BEGIN_definition
Object Language is the language can be described by metalanguage.
#+END_definition

#+ATTR_LATEX: :options [Object(w.r.t. object language)]
#+BEGIN_definition
Objects are formalized elements of the language.
#+END_definition

To formalize interesting properties of a structure, one need the following things:

#+ATTR_LATEX: :options [Individual Variables(Informal)]
#+BEGIN_definition
Individual variables are a "place-holder" with a predicate letter. It stands for unspecified argument of the predicate.
#+END_definition

#+ATTR_LATEX: :options [Extralogic Structures(w.r.t. the given language)]
#+BEGIN_definition
Sufficient number of relations, funcitons and constant.
#+END_definition

The language with the two features above is the first order language or elementary languages, now we give a formal definiton.

#+ATTR_LATEX: :options [First-order language(Informal)]
#+BEGIN_definition
First-order language is a set consists of the following type of subsets:
- Alphabet
  - Individual variables(Var): countably many variables.
  - Extralogic structures
- Syntax of first-order logic
- Semantics of first-order logic
#+END_definition

*Remark:*
- *One can only differ two first-order language by the Extralogical Structures.*
- *Individual Variables here often denotes by \(x,y,z,\dots\).*

#+ATTR_LATEX: :options [Alphabet]
#+BEGIN_definition
Alphabet is the set of basic symbols of a first-order language determined by a (extralogical) signature \(L\).
#+END_definition

* Gödel's Completeness Theorem

\begin{center}
\begin{tikzpicture}
\tikzstyle{line} = [draw, -latex']

\node[align = center] (Deduction)
{
\begin{tabular}{l}
\textbf{Natural Deduction:} Gentzen's type \(\vdash_G\)\\
\textbf{Hilbert Calculi:} Modus ponens \(\vdash_H\)
\end{tabular}};

\node[align = center, right = of Deduction] (CompletenessTheorem)
{\textbf{Gödel's Completeness Theorem} \\
\begin{tabular}{l}
1. \(\vdash_H = \models\) \\
2. \(\vdash_G = \models\) \\
3. \textbf{Finiteness Theorem:} \\ \(X \models \alpha \Rightarrow  X_0 \models \alpha, X_0 \subseteq X, X_0 \text{ finite.}\) \\
4. \textbf{Compactness Theorem(Syntactic):} \\ Any set of first order formula \(X\) is satisfiable \(\Rightarrow\) \\ Every finite subset of \(X\) is satisfiable.
\end{tabular}
};

\node[align = center, below = of CompletenessTheorem] (Complete)
{A theory is \textbf{complete} if it is consistent \\ and has no proper consistent extension.};

\path [draw] (Deduction) -- (CompletenessTheorem);
\path [draw] (CompletenessTheorem) -- (Complete);

\end{tikzpicture}
\end{center}

* COMMENT
*Below is a sketch of what are the key points*
** Implication and Negation
*** Properties of logical implication
** Axiom Sets
*** First-Order Description

** Zorn's Lemma
** Relations
*** Order-Relations
*** Symmetry of Relations
*** Irreflexive Relations
*** Finite groups and order-relations
** Models
*** Axioms of Integral Domains
*** Terms
*** Formula Truth
*** Variable Occurrences
*** Substitutions
*** Truth in Structures
*** First-order sentences
*** Number of Models
** Logical Implication
*** Deciding Logical Implication
** Famous Formulas

** Derivations
*** Derivation of Formulas
** Structure
*** Axioms for Structures
*** Constant Structures
** Proofs in First-Order Logic
** Natural numbers and Successor
** Dense Linear Order
** Addition Machines
** Recursion
** Unbounded Search
** Enumerations of total functions
** Robinson's Arithmetic
** Categoricity

* Incompleteness and Undecidability
Overview:
\begin{center}\begin{tikzcd}
\text{Recursive and Primitive Recursive Functions} \ar[d] & \text{Arithmatic on syntax and formal proofs} \ar[dl]\\
\text{Representability of recursive functions} \ar[d] & \\
\text{First Incompleteness Theorem} \ar[d] \ar[dr] \\
\text{Decidability and Undecidability} & \text{First-order arithmetical hierachy}
\end{tikzcd}\end{center}

Gödel's first incompleteness theorem informal description:
*Basic Assumption:*
\begin{center}\begin{tikzcd}
\mathcal{T}:\text{Axiomatic theory} \ar[r,"\text{describe}"] & \mathcal{A}:\text{Given domain of objects} \\
\mathcal{L}:\text{Language of} \mathcal{T} \ar[u,"\text{Internal encoding of syntax of}\mathcal{L}"]
\end{tikzcd}\end{center}

*Result:*
Sentence \(\gamma:\)"I(\(\gamma\)) am provable in \(\mathcal{T}\)" is true in \(\mathcal{A}\) but unprovable in \(\mathcal{T}\)

This result is kind of like the liar paradox. "I will not died because of fire." This is true because within the rule I will not die. This is unprovable because we can't make sure the semantic of this sentence within the rules.


