MathematicalLogicAndTheoreticalCS/AConciseIntroductionToMathematicalLogic/AConciseIntroductionToMathematicalLogic.tex
\subsection{Mathematical Structures}
\label{sec:org6d3982a}

\begin{definition}["Specific" Structure and related definition]
For structure \(\mathfrak{A}\) we have the following description:

\begin{center}
\begin{tabular}{ccc}
Notations & \(A\): Domain & relations \(r\), operations \(f\), constant \(c\)\\

Descriptions & finite(infinite) structure & relation(algebraic) structure
\end{tabular}
\end{center}

\begin{itemize}
\item Relation structure has no operation and constant
\item Algebraic structure has no relation
\end{itemize}
\end{definition}

\textbf{We want to study the class of structures, so we need a ``connection'' which enables us to talk about a class of structures.}

\begin{definition}[Extralogical Signature]
A finite set \(L\) consisting of relation, operation, and constant symbols of given arity, is a (extralogical) structure.
\end{definition}

\begin{definition}[Closed under operations]
\(\forall a \in A^n \Rightarrow fa \in A\).
\end{definition}

\begin{definition}[Restriction to a subset of domain]
\textbf{Restriction for Relation:}
\begin{itemize}
\item Intersect product sets
\end{itemize}
\textbf{Restriction for Operations:}
\begin{itemize}
\item Closed under operations w.r.t. the subset which we want to restrict on.
\end{itemize}
\end{definition}

\begin{definition}[Substructure]
Let \(\mathfrak{B}\) be an L-Structure, \(A \subset B\) nonempty and closed
under all operations of \(B\) and inherits all the interpratations of constant of \(B\).
\end{definition}

\begin{proposition}[Common properties of binary operations and binary relations]
\textbf{Properties for binary operations:}
\begin{itemize}
\item Commutivity;
\item Associativity;
\item Idempotent: \(a \circ a = a\);
\item Invertible: \(\forall a,b, \exists x,y \Rightarrow a \circ x = b \land y \circ a = b\).
\end{itemize}

\textbf{Properties for binary relations:}
\begin{itemize}
\item reflexive and irreflexive;
\item symmetric and antisymmetric;
\item transitive;
\item connex(Trinity).
\end{itemize}
\end{proposition}
\subsection{Syntax of Elementary Languages}
\label{sec:org12bf8a7}

\begin{center}
\begin{tikzpicture}
\tikzstyle{line} = [draw, -latex']

\node [align = center] (Term)
{\textbf{Term} \\
\begin{tabular}{l}
1. \textbf{Prime Term} : Variables and constants \\
2. \textbf{Compound of functional symbol and terms}
\end{tabular}};

\node[right = of Term, align = center] (Formula)
{\textbf{Formula} \\
\begin{tabular}{l}
1. \textbf{Terms} \\
2. \textbf{Compound of relation and terms} \\
3. \textbf{Compound of logical connectives} \\ \textbf{and formulas}
\end{tabular}};

\node[below = of Formula] (Variables)
{\begin{tabular}{l}
1. \textbf{Variable} \\
2. \textbf{Free Variable} \Rightarrow \textbf{Sentences}\\
3. \textbf{Bounded Variable}
\end{tabular}
};


\path [line] (Term) -- (Formula);
\path [line] (Formula) -- (Variables);

\end{tikzpicture}
\end{center}

\textbf{Goal: We want to delimit(determine the limit) the theoretical framework which enables us to precisely talk about mathematical structures}

This goal arise the definition of object language.
\begin{definition}[Object Language]
Object Language is the language can be described by metalanguage.
\end{definition}

\begin{definition}[Object(w.r.t. object language)]
Objects are formalized elements of the language.
\end{definition}

To formalize interesting properties of a structure, one need the following things:

\begin{definition}[Individual Variables(Informal)]
Individual variables are a ``place-holder'' with a predicate letter. It stands for unspecified argument of the predicate.
\end{definition}

\begin{definition}[Extralogic Structures(w.r.t. the given language)]
Sufficient number of relations, funcitons and constant.
\end{definition}

The language with the two features above is the first order language or elementary languages, now we give a formal definiton.

\begin{definition}[First-order language(Informal)]
First-order language is a set consists of the following type of subsets:
\begin{itemize}
\item Alphabet
\begin{itemize}
\item Individual variables(Var): countably many variables.
\item Extralogic structures
\end{itemize}
\item Syntax of first-order logic
\item Semantics of first-order logic
\end{itemize}
\end{definition}

\textbf{Remark:}
\begin{itemize}
\item \textbf{One can only differ two first-order language by the Extralogical Structures.}
\item \textbf{Individual Variables here often denotes by \(x,y,z,\dots\).}
\end{itemize}

\begin{definition}[Alphabet]
Alphabet is the set of basic symbols of a first-order language determined by a (extralogical) signature \(L\).
\end{definition}
\section{Gödel's Completeness Theorem}
\label{sec:org78074cd}

\begin{center}
\begin{tikzpicture}
\tikzstyle{line} = [draw, -latex']

\node[align = center] (Deduction)
{
\begin{tabular}{l}
\textbf{Natural Deduction:} Gentzen's type \(\vdash_G\)\\
\textbf{Hilbert Calculi:} Modus ponens \(\vdash_H\)
\end{tabular}};

\node[align = center, right = of Deduction] (CompletenessTheorem)
{\textbf{Gödel's Completeness Theorem} \\
\begin{tabular}{l}
1. \(\vdash_H = \models\) \\
2. \(\vdash_G = \models\) \\
3. \textbf{Finiteness Theorem:} \\ \(X \models \alpha \Rightarrow  X_0 \models \alpha, X_0 \subseteq X, X_0 \text{ finite.}\) \\
4. \textbf{Compactness Theorem(Syntactic):} \\ Any set of first order formula \(X\) is satisfiable \(\Rightarrow\) \\ Every finite subset of \(X\) is satisfiable.
\end{tabular}
};

\node[align = center, below = of CompletenessTheorem] (Complete)
{A theory is \textbf{complete} if it is consistent \\ and has no proper consistent extension.};

\path [draw] (Deduction) -- (CompletenessTheorem);
\path [draw] (CompletenessTheorem) -- (Complete);

\end{tikzpicture}
\end{center}
\section{Incompleteness and Undecidability}
\label{sec:org141a500}
Overview:
\begin{center}\begin{tikzcd}
\text{Recursive and Primitive Recursive Functions} \ar[d] & \text{Arithmatic on syntax and formal proofs} \ar[dl]\\
\text{Representability of recursive functions} \ar[d] & \\
\text{First Incompleteness Theorem} \ar[d] \ar[dr] \\
\text{Decidability and Undecidability} & \text{First-order arithmetical hierachy}
\end{tikzcd}\end{center}

Gödel's first incompleteness theorem informal description:
\textbf{Basic Assumption:}
\begin{center}\begin{tikzcd}
\mathcal{T}:\text{Axiomatic theory} \ar[r,"\text{describe}"] & \mathcal{A}:\text{Given domain of objects} \\
\mathcal{L}:\text{Language of} \mathcal{T} \ar[u,"\text{Internal encoding of syntax of}\mathcal{L}"]
\end{tikzcd}\end{center}

\textbf{Result:}
Sentence \(\gamma:\)``I(\(\gamma\)) am provable in \(\mathcal{T}\)'' is true in \(\mathcal{A}\) but unprovable in \(\mathcal{T}\)

This result is kind of like the liar paradox. ``I will not died because of fire.'' This is true because within the rule I will not die. This is unprovable because we can't make sure the semantic of this sentence within the rules.
