MathematicalLogicAndTheoreticalCS/AConciseIntroductionToMathematicalLogic/AConciseIntroductionToMathematicalLogic.org
** Recursive and Primitive Recursive Functions

#+ATTR_LATEX: :options [Partial Function]
#+BEGIN_definition
Let \(X,Y\) be sets, \(S\subset X\). \(f:S\to Y\) is a partial function from \(X\to Y\).
#+END_definition

*Difference between primitive recursive functions and recursive functions*
- Primitive recursive functions are from primitive recursive functions with one input.
- Recursive function: Partial functions take finite tuples of natural numbers and return a single natural number.

#+ATTR_LATEX: :options [ ]
#+BEGIN_proposition
Primitive recursive function \(\subset\) Recursive function \(\subset\) Partial recusive function.
#+END_proposition

#+ATTR_LATEX: :options [Halting Problem]
#+BEGIN_definition

#+END_definition

*Goal: Code Undecidability into logic*

#+ATTR_LATEX: :options [Computation]
#+BEGIN_definition
Computation is a sequence of configuration of addition mechine.
#+END_definition

*Remark: Here configuration means the current states.*

* Kappa-categorical
#+ATTR_LATEX: :options [Kappa-categorical]
#+BEGIN_definition
We say a theory is \(\aleph_0\)-categorical if any countable infinite models are isomorphic.
#+END_definition
