MathematicalLogicAndTheoreticalCS/AConciseIntroductionToMathematicalLogic/AConciseIntroductionToMathematicalLogic.tex
\subsection{Recursive and Primitive Recursive Functions}
\label{sec:orgbd23541}

\begin{definition}[Partial Function]
Let \(X,Y\) be sets, \(S\subset X\). \(f:S\to Y\) is a partial function from \(X\to Y\).
\end{definition}

\textbf{Difference between primitive recursive functions and recursive functions}
\begin{itemize}
\item Primitive recursive functions are from primitive recursive functions with one input.
\item Recursive function: Partial functions take finite tuples of natural numbers and return a single natural number.
\end{itemize}

\begin{proposition}[ ]
Primitive recursive function \(\subset\) Recursive function \(\subset\) Partial recusive function.
\end{proposition}

\begin{definition}[Halting Problem]

\end{definition}

\textbf{Goal: Code Undecidability into logic}

\begin{definition}[Computation]
Computation is a sequence of configuration of addition mechine.
\end{definition}

\textbf{Remark: Here configuration means the current states.}
\section{Kappa-categorical}
\label{sec:org36b97e1}
\begin{definition}[Kappa-categorical]
We say a theory is \(\aleph_0\)-categorical if any countable infinite models are isomorphic.
\end{definition}
\end{document}
